---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleType
source: html/83c09b9a-763d-76ad-3d2a-1ac3b987f6f8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleType Property

"Type"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleType { get; }
```